integration/OpenCFD/testCases/waveExampleStokesI/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            waveInletVelocity;
        value           uniform (0 0 0);
    }

    outlet
    {
        type            waveInletVelocity;
        value           uniform (0 0 0);
    }

    sides
    {
	type            empty;
    }

    ground
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    top
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }
}

// ************************************************************************* //
